000100180606     A*%%TS  SD  20180606  075200  DICKJAZ     REL-V7R2M0  5770-WDS
000200180606     A*%%EC
000300180606     A                                      DSPSIZ(24 80 *DS3)
000400180606     A                                      CF01(01 'Help')
000500180606     A                                      CF06(06 'Keys')
000600180606     A                                      CF05(05 'Convert')
000700180606     A                                      CF09(09 'Print')
000800180606     A                                      CA12(12 'Previous')
000900180606     A          R HEADING
001000180606     A*%%TS  SD  20180606  075200  DICKJAZ     REL-V7R2M0  5770-WDS
001100180606     A                                  1  2DATE
001200180606     A                                      EDTCDE(Y)
001300180606     A                                  1 14'Format:'
001400180606     A                                  1 35'Table Layout'
001500180606     A                                  1 58'Bytes:'
001600180606     A                                  1 72TIME
001700180606     A            FORMATN       10A  O  2 14DSPATR(HI)
001800180606     A            CLO           21A  O  2 30DSPATR(HI)
001900180606     A            BYTES          5Y 0O  2 59EDTCDE(Z)
002000180606     A                                      DSPATR(HI)
002100180606     A                                  3  8'Description:'
002200180606     A            ATTXTP        50A  O  3 21DSPATR(HI)
002300180606     A                                  4 10'Field'
002400180606     A                                  5 10'Name'
002500180606     A                                  5 22'Description'
002600180606     A                                  5 53'A/C'
002700180606     A                                  5 59'Len'
002800180606     A                                  5 65'D'
002900180606     A                                  5 70'From'
003000180606     A                                  5 78'To'
003100180513     A          R SFL01                     SFL
003200180513     A*%%TS  SD  20011225  034035  DICKJ       REL-V3R7M0  5716-PW1
003300180513     A            XRRNS1         3S 0H
003400180513     A            SF01DATA      78A  O  6  2
003500180606     A          R CTL01                     SFLCTL(SFL01)
003600180606     A*%%TS  SD  20180606  075200  DICKJAZ     REL-V7R2M0  5770-WDS
003700180606     A                                      BLINK
003800180606     A                                      OVERLAY
003900180606     A  27                                  SFLDSP
004000180606     A  28                                  SFLDSPCTL
004100180606     A  29                                  SFLCLR
004200180606     A                                      SFLSIZ(0180)
004300180606     A                                      SFLPAG(0017)
004400180606     A                                 23  2'F1=Help'
004500180606     A                                      COLOR(BLU)
004600180606     A                                 23 11'F6=Key Fields'
004700180606     A                                      COLOR(BLU)
004800180606     A                                 23 26'F5=Run Conv.'
004900180606     A                                      COLOR(BLU)
005000180606     A                                 23 40'F9=Print'
005100180606     A                                      COLOR(BLU)
005200180606     A                                 23 50'F12=Previous'
005300180606     A                                      COLOR(BLU)
005400180606     A            ERROR         76A  O 24  2DSPATR(HI)
005500180517     A          R WIN01
005600180517     A*%%TS  SD  20180517  121109  DICKJAZ     REL-V7R2M0  5770-WDS
005700180517     A                                      WINDOW(6 24 6 22 *NOMSGLIN)
005800180517     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
005900180517     A                                          '))
006000180517     A                                  1  4'Printing Options'
006100180517     A                                      DSPATR(HI)
006200180517     A                                  3  7'Copies:'
006300180517     A            COPYS          2Y 0B  3 15DSPATR(HI)
006400180517     A                                      DSPATR(CS)
006500180517     A                                      EDTCDE(Z)
006600180517     A                                  4  7'Duplex:'
006700180517     A            DUPLEX         1   B  4 15DSPATR(HI)
006800180517     A                                      DSPATR(CS)
006900180517     A                                      VALUES(' ' 'N' 'Y')
007000180517     A                                  6  1'F1=Help'
007100180517     A                                      COLOR(BLU)
007200180517     A                                  6 10'F12=Previous'
007300180517     A                                      COLOR(BLU)
007400180516     A          R SFL02                     SFL
007500180516     A*%%TS  SD  20180516  185411  DICKJAZ     REL-V7R2M0  5770-WDS
007600180516     A            XRRNS2         3S 0H
007700180516     A            SF02DATA      30   O  2  1DSPATR(HI)
007800180516     A          R CTL02                     SFLCTL(SFL02)
007900180516     A*%%TS  SD  20180516  185411  DICKJAZ     REL-V7R2M0  5770-WDS
008000180516     A                                      SFLSIZ(0020)
008100180516     A                                      SFLPAG(0005)
008200180517     A                                      WINDOW(WIN02)
008300180516     A                                      OVERLAY
008400180516     A  27                                  SFLDSP
008500180516     A  28                                  SFLDSPCTL
008600180516     A  29                                  SFLCLR
008700180516     A                                  1  1'Key Fields:'
008800180517     A            UNIQYN         7   O  1 24DSPATR(HI)
008900180517     A          R WIN02
009000180517     A*%%TS  SD  20180516  185411  DICKJAZ     REL-V7R2M0  5770-WDS
009100180517     A                                      WINDOW(6 24 7 30 *NOMSGLIN)
009200180517     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
009300180517     A                                          '))
009400180517     A                                  7  1'F1=Help'
009500180517     A                                      COLOR(BLU)
009600180517     A                                  7 10'F12=Previous'
009700180517     A                                      COLOR(BLU)
009800180516     A          R DUMMY                     ASSUME
009900180516     A                                  1  2' '
