000100180731       Ctl-Opt DFTNAME(FLMFLU) BNDDIR('FLBFLU') ;
000200180731       Ctl-Opt DEBUG OPTION(*NODEBUGIO: *SRCSTMT);
000300180731       Ctl-Opt COPYRIGHT('SHandB, LLC 2017/1024');
000400180731       // Run the FLM405 module
000500180731       //-------- Prototypes ---------*
000600180731      /Copy QRPGLESRC,FLT001
000700180731       Dcl-S EOJ  Char(2) ;
000800180731       // FLM400DS = FLM400();
000900180731       EOJ = FLM405();
001000180731       *INLR = *ON ;
